src/Enums/ДоступныеАТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ДоступныеАТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>MangoOffice</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RiNet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VirginConnect</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Авантел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВестКоллМосква</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВестКоллСПб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГарсТелеком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Гравител</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДеловаяСетьИркутск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДомRu</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МГТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мегафон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаукаСвязь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ростелеком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СибирскиеСети</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТТК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УниверсальныйItoolabs</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Энфорта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Яндекс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ДоступныеАТС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет ссылки на внешние страницы описания поддерживаемых ВАТС.
// 
// Возвращаемое значение:
//  СписокЗначений - Ссылки на статьи:
//   * Ключ - ПеречислениеСсылка.ДоступныеАТС
//   * Значение - Строка - Навигационная ссылка на статью.
//
Функция СсылкиНаСтатьи() Экспорт
	
	Ссылки = Новый СписокЗначений;
	Ссылки.Добавить(Перечисления.ДоступныеАТС.MangoOffice,        "https://www.mango-office.ru/products/virtualnaya_ats");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.ДомRu,              "https://b2b.domru.ru/products/oats-new?utm_source=1c_unf&utm_medium=button&utm_campaign=federal");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.Яндекс,             "https://telephony.yandex.ru/");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.Ростелеком,         "https://rt.ru/b2b/telephony/vats");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.ВестКоллСПб,        "http://oats.westcall.spb.ru?utm_source=1C&utm_medium=cpc&utm_campaign=instrukciya");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.ДеловаяСетьИркутск, "http://ats.dsi.ru/");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.Энфорта,            "https://www.enforta.ru/services/enfortats/");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.Мегафон,            "https://vats.megafon.ru/");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.ТТК,                "http://myttk.ru/business/services/virtualnaya_ats_/");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.ВестКоллМосква,     "http://westcall.ru/atc/");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.VirginConnect,      "http://virginconnect.ru/pbx/");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.ГарсТелеком,        "http://garstelecom.ru/for-business/all-solutions/virtualnaya-ats-ip-telefoniya/");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.НаукаСвязь,         "http://www.naukanet.ru/vpbx/");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.RiNet,              "http://corp.rinet.ru/services/virtual_ats/");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.СибирскиеСети,      "https://b2b.sibset.ru/services/ip");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.Авантел,            "http://avantel.ru/services/telephony/");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.Гравител,           "https://www.gravitel.ru/services/virtual_ats/");
	Ссылки.Добавить(Перечисления.ДоступныеАТС.МГТС,               "https://vats.mgts.ru/");
	Ссылки.Добавить("МобильнаяТелефония",                         "https://its.1c.ru/db/updinfo#content:479:1:issogl2_2");
	
	Возврат Ссылки;
	
КонецФункции

// Список АТС на платформе Itoolabs, которые подключаются универсальным виджетом.
// 
// Возвращаемое значение:
// 	ТаблицаЗначений:
// * Идентификатор - Строка
// * Представление - Строка
// * Ссылка - Строка
//
Функция ДоступныеАТСУниверсальногоВиджетаItoolabs() Экспорт
	
	Ссылки = Новый ТаблицаЗначений;
	Ссылки.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Ссылки.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Ссылки.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("Строка"));
	
	// АПК:1036-выкл проверка орфографии в названиях сторонних сервисов не требуется.
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Altegro";
	Ссылка.Представление = НСтр("ru='Altegro'");
	Ссылка.Ссылка = "http://altegrocloud.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "АльянсТелеком";
	Ссылка.Представление = НСтр("ru='АльянсТелеком'");
	Ссылка.Ссылка = "http://inetvl.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "ВАМтел";
	Ссылка.Представление = НСтр("ru='ВАМтел'");
	Ссылка.Ссылка = "http://vamtel.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "ВекторТел";
	Ссылка.Представление = НСтр("ru='ВекторТел'");
	Ссылка.Ссылка = "http://vectortel.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "КорпорацияVoIP";
	Ссылка.Представление = НСтр("ru='Корпорация VoIP'");
	Ссылка.Ссылка = "http://corpvoip.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "ИнтИнформ";
	Ссылка.Представление = НСтр("ru='Инт-Информ'");
	Ссылка.Ссылка = "http://intinform.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Интеграл";
	Ссылка.Представление = НСтр("ru='Интеграл'");
	Ссылка.Ссылка = "http://i-t.spb.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Кловертел";
	Ссылка.Представление = НСтр("ru='Кловертел'");
	Ссылка.Ссылка = "https://clovertel.pulscen.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Comiten";
	Ссылка.Представление = НСтр("ru='Comiten'");
	Ссылка.Ссылка = "http://comiten.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "SipVip";
	Ссылка.Представление = НСтр("ru='SipVip'");
	Ссылка.Ссылка = "https://sipvip.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Комфинанс";
	Ссылка.Представление = НСтр("ru='Комфинанс'");
	Ссылка.Ссылка = "http://www.comfinance.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "КонтинентКоннект";
	Ссылка.Представление = НСтр("ru='Континент Коннект'");
	Ссылка.Ссылка = "http://kkont.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "КРОК";
	Ссылка.Представление = НСтр("ru='КРОК'");
	Ссылка.Ссылка = "http://www.croc.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "КТелеком";
	Ссылка.Представление = НСтр("ru='К Телеком'");
	Ссылка.Ссылка = "https://ekaterinburg.k-telecom.org/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "МАТРИКСмобайл";
	Ссылка.Представление = НСтр("ru='МАТРИКС мобайл'");
	Ссылка.Ссылка = "http://matrixmobile.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Миран";
	Ссылка.Представление = НСтр("ru='Миран'");
	Ссылка.Ссылка = "http://miran.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "МортонТелеком";
	Ссылка.Представление = НСтр("ru='Мортон Телеком'");
	Ссылка.Ссылка = "http://www.mtel.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "САЛЬВАДОРтелефония";
	Ссылка.Представление = НСтр("ru='САЛЬВАДОР телефония'");
	Ссылка.Ссылка = "http://sip-melt.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Новотелс";
	Ссылка.Представление = НСтр("ru='Новотелс'");
	Ссылка.Ссылка = "http://novotels.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "TelefonCo";
	Ссылка.Представление = НСтр("ru='TelefonCo'");
	Ссылка.Ссылка = "http://telefonco.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Омскиекабельныесети";
	Ссылка.Представление = НСтр("ru='Омские кабельные сети'");
	Ссылка.Ссылка = "http://www.omkc.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Мегатон";
	Ссылка.Представление = НСтр("ru='Мегатон'");
	Ссылка.Ссылка = "http://megaton-net.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "CLOUDGATES";
	Ссылка.Представление = НСтр("ru='CLOUDGATES'");
	Ссылка.Ссылка = "https://cloudgates.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "РЕНЕТКОМ";
	Ссылка.Представление = НСтр("ru='РЕНЕТ КОМ'");
	Ссылка.Ссылка = "http://renet.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "РУКОМТЕХ";
	Ссылка.Представление = НСтр("ru='РУКОМТЕХ'");
	Ссылка.Ссылка = "http://www.rucom.tech/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Русскиесистемы";
	Ссылка.Представление = НСтр("ru='Русские системы'");
	Ссылка.Ссылка = "http://www.ru-sys.com/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "СвязьХолдинг";
	Ссылка.Представление = НСтр("ru='Связь-Холдинг'");
	Ссылка.Ссылка = "http://govorit.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "АОНорильскТелеком";
	Ссылка.Представление = НСтр("ru='АО ""Норильск-Телеком""'");
	Ссылка.Ссылка = "http://norcom.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "SMARTCARD";
	Ссылка.Представление = НСтр("ru='SMARTCARD'");
	Ссылка.Ссылка = "http://smcard.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "ТВИНГОтелеком";
	Ссылка.Представление = НСтр("ru='ТВИНГО телеком'");
	Ссылка.Ссылка = "http://tvingo.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Tekmi";
	Ссылка.Представление = НСтр("ru='Tekmi'");
	Ссылка.Ссылка = "http://tekmi.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "EVO";
	Ссылка.Представление = НСтр("ru='EVO'");
	Ссылка.Ссылка = "https://www.evo73.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Телемир";
	Ссылка.Представление = НСтр("ru='Телемир'");
	Ссылка.Ссылка = "http://telemir.net/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Телетай";
	Ссылка.Представление = НСтр("ru='Телетай'");
	Ссылка.Ссылка = "http://www.teletie.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "TelefonN";
	Ссылка.Представление = НСтр("ru='TelefonN'");
	Ссылка.Ссылка = "http://telefonn.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "OpenSpeak";
	Ссылка.Представление = НСтр("ru='OpenSpeak'");
	Ссылка.Ссылка = "http://openspeak.kz/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Ультрамарин";
	Ссылка.Представление = НСтр("ru='Ультрамарин'");
	Ссылка.Ссылка = "http://www.ul.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Щелковоnet"; // АПК:1036
	Ссылка.Представление = НСтр("ru='Щелково-net'");
	Ссылка.Ссылка = "http://www.schelkovo-net.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Эконотел";
	Ссылка.Представление = НСтр("ru='Эконотел'");
	Ссылка.Ссылка = "http://econotel.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "ЮГТЕЛЕКОМ";
	Ссылка.Представление = НСтр("ru='ЮГ-ТЕЛЕКОМ'");
	Ссылка.Ссылка = "http://www.southtel.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "DreamNet";
	Ссылка.Представление = НСтр("ru='DreamNet'");
	Ссылка.Ссылка = "https://dreamnet.su/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Easytel";
	Ссылка.Представление = НСтр("ru='Easytel'");
	Ссылка.Ссылка = "http://easytel.top/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Finenumbers";
	Ссылка.Представление = НСтр("ru='Finenumbers'");
	Ссылка.Ссылка = "http://finenumbers.com/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "НовыеТелефонныеСистемы";
	Ссылка.Представление = НСтр("ru='Новые Телефонные Системы'");
	Ссылка.Ссылка = "http://www.newtehno.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "PowerTelecom";
	Ссылка.Представление = НСтр("ru='Power Telecom'");
	Ссылка.Ссылка = "http://powertelecom.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Spacetel";
	Ссылка.Представление = НСтр("ru='Spacetel'");
	Ссылка.Ссылка = "http://spacetel.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "COMLINK";
	Ссылка.Представление = НСтр("ru='COMLINK'");
	Ссылка.Ссылка = "http://comlink.su/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "Экомобайл";
	Ссылка.Представление = НСтр("ru='Экомобайл'");
	Ссылка.Ссылка = "http://www.ekomobile.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "TASHIRTELECOM";
	Ссылка.Представление = НСтр("ru='TASHIR TELECOM'");
	Ссылка.Ссылка = "https://tashirtelecom.ru/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "TELEPRO";
	Ссылка.Представление = НСтр("ru='TELEPRO'");
	Ссылка.Ссылка = "http://www.telepro.pro/";
	
	Ссылка = Ссылки.Добавить();
	Ссылка.Идентификатор = "NETBYNET";
	Ссылка.Представление = НСтр("ru='NETBYNET'");
	Ссылка.Ссылка = "http://www.netbynet.ru/";
	// АПК:1036-вкл
	
	Возврат Ссылки;
	
КонецФункции

// Определяет, работает ли указанная АТС на платформе Itoolabs.
// 
// Параметры:
// 	АТС - ПеречислениеСсылка.ДоступныеАТС
// Возвращаемое значение:
// 	Булево
//
Функция ЭтоПлатформаItoolabs(АТС) Экспорт
	
	АТСНаПлатформеItoolabs = Новый Массив;
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.RiNet);
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.VirginConnect);
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.Авантел);
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.ВестКоллМосква);
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.ВестКоллСПб);
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.ГарсТелеком);
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.Гравител);
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.ДеловаяСетьИркутск);
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.ДомRu);
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.МГТС);
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.Мегафон);
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.НаукаСвязь);
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.СибирскиеСети);
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.ТТК);
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.УниверсальныйItoolabs);
	АТСНаПлатформеItoolabs.Добавить(Перечисления.ДоступныеАТС.Энфорта);
	
	Возврат АТСНаПлатформеItoolabs.Найти(АТС) <> Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
